{"basics":{"name":"Varun Sharma","label":"Builder. Problem Solver.","image":"","url":"https://sharmavarun.in","summary":"I have worked on a diverse set of problems, tools and technologies in the last 2 decades. I enjoy working on complex problems that require a blend of technical and business acumen.","location":{"city":"Bangalore","countryCode":"IN"},"profiles":[{"network":"LinkedIn","username":"shvarun","url":"https://www.linkedin.com/in/shvarun/"}]},"work":[{"name":"AuxoAI","position":"Head of Products","url":"https://auxoai.com","startDate":"2023-11-20","summary":"","highlights":["Artificial Intelligence","Product Management","Product Engineering"]}],"education":[{"institution":"Indian Institute of Technology, Kanpur","location":"Kanpur, India","url":"https://www.iitk.ac.in/","area":"Computer Science and Engineering","studyType":"Bachelor of Technology","startDate":"2003-08-01","endDate":"2007-05-30","score":"8.5/10"}],"publications":[{"name":"SCoPe: A Decision System for Large Scale Container Provisioning Management","publisher":" 2016 IEEE 9th International Conference on Cloud Computing (CLOUD)","releaseDate":"2016","url":"https://ieeexplore.ieee.org/abstract/document/7820275","summary":"Operating system (OS) containers provide a process level virtualization in a multi-tenant Cloud environment. Such containers are becoming increasingly popular in developer community as they facilitate fast development and delivery of enterprise class Cloud services. Furthermore, these containers share a common OS and hence, they have a low resource foot-print leading to reduced provisioning time. In this paper, we investigate such promise of containers while provisioning large scale 3-tier applications. First, through benchmarking, we observe that at very large scale, several application scaling factors (e.g., number of containers of an application provisioned in parallel, application load) and system state parameters (e.g., number of applications and containers running on a system) introduce variability in application provisioning time because of resource bottleneck in general, and specifically due to the OS process overhead. To address such variability, we propose a provisioning decision management system SCoPe that provides an application partitioning and provisioning strategy where we determine the maximum number of containers of every application that can be provisioned in parallel across physical machines, while meeting the service level agreement (SLA) on provisioning time and Cloud provider specific objectives (e.g., maximize consolidation of applications, minimize operating cost). This joint partitioning and provisioning problem is NP-hard and we propose a greedy heuristic solution. Using real data set and through extensive experiments, we demonstrate the performance of SCoPe for large scale container based application provisioning. Compared to other well-known heuristics, SCoPe can reduce the partitioning by 5x or more, while meeting SLAs."},{"name":"A Scalable Approach for Context Based Complex Service Discovery","publisher":"2015 IEEE International Conference on Web Services","releaseDate":"2015","url":"https://ieeexplore.ieee.org/abstract/document/7195611","summary":"Discovering and matching services is an area that has been extensively explored. In this paper we envision services that advertise not only their functional parameters, but also highlight the Quality of Service(QoS) guarantees (or non-functional parameters) they can provide. As a result users can also incorporate QoS requirements along with the service request. Given the vast pool of services available today, leading to complex ontologies, the search space becomes extremely large, increasing the complexity of the search. We construct an overlay reflecting the relationships between the services, which facilitates the pruning of the entire search space. Additionally our system takes into consideration the user context which provides information pertaining to the users preferences. (eg: A user could be performance-savvy or functionally-cautious etc) We propose an algorithm CCD (Context based Complex service Discovery), which utilizes the inputs provided by the users and determines the similarity quotient for the functional and QoS parameters. Our experiments show that CCD significantly improves the scalability of the search by aggressively pruning the search space, achieved by visiting only relevant nodes. CCD further uses the requester context to improve the recommendations provided to the requester. We also compare CCD with two baseline approaches based on the depth-first search algorithm on a travel ontology, which was created using real service definitions from the Open Travel Alliance (OTA)."},{"name":"Personalized Messaging Engine: The Next Step in Employee Engagement","publisher":"2015 IEEE International Conference on Service-Oriented Computing","releaseDate":"2015","url":"https://link.springer.com/chapter/10.1007/978-3-662-48616-0_36","summary":"Employers today are struggling to engage positively with their employees to reduce attrition and improve productivity. There are solutions in the market which are trying to solve the problem but they suffer from two critical issues. Firstly, the scope of the existing solutions is too narrow to capture each and every interaction happening within the company. Secondly, their learning from the employee behaviour is either non-existent or minimal at best. Personalized Messaging Engine (PME) is an attempt to provide end-to-end system to organizations for effective employee engagement. PME uses SOA principles to connect to each and every system through which employees engage with their employers. It uses the data aggregated from multiple systems to provide a hyper-personalized and dynamic experience to each employee. With the help of APIs, multiple systems can push data to PME and it then processes the data to send relevant pre-configured messages to the employees in the domain of Health, Wealth and Career. Additionally, PME uses several factors to prioritize messages for each and every employee. It uses a state-of-the-art learning engine to combine Subject Matter Experts opinion, Client Strategy, User Experiences and behaviour to find the messages which are most effective for the employees."}],"skills":[{"name":"System Design","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Technical Architect","Domain Driven Design","Cloud Computing"]},{"name":"Machine Learning","level":"Beginner","icon":"fa-solid fa-hashtag","keywords":["Generative AI","Natural Language Processing","MLOps"]}],"languages":[{"language":"Hindi","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Fluent","icon":""}]}